[
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 90,
        "name": "Codebasics",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Social Media"
        ]
    },
    {
        "text": "Jobseekers, this one's for you.\n Every application, every interview, every follow-up… the pressure is immense.\n And I know what you're thinking: Am I not good enough? \n But let me tell you, this isn't about you or your skills. It's about a broken system where 60% of applicants never hear back. \n Your mental health is not worth sacrificing for a system that doesn't acknowledge your worth. \n Please remember, taking care of yourself is the real priority. \n Your dream job will come, but for now, breathe.",
        "engagement": 347,
        "name": "Codebasics",
        "line_count": 7,
        "language": "English",
        "tags": [
            "Mental Health",
            "Job Search"
        ]
    },
    {
        "text": "Looking for jobs on LinkedIn is like online dating: Full of promises, but in the end, you're just left ghosted.",
        "engagement": 109,
        "name": "Codebasics",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Relationships",
            "Job Search"
        ]
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn't even apply for!' \n The catch? Pay Rs. 50,000 for the honor.",
        "engagement": 115,
        "name": "Codebasics",
        "line_count": 2,
        "language": "English",
        "tags": [
            "Scams"
        ]
    },
    {
        "text": "sapne dekhna achi baat hai,\nlekin job ka sapna dekh ke 'interested' likhna,\nyeh toh achi baat nahi hai na?",
        "engagement": 545,
        "name": "Codebasics",
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Unknown",
            "Job Search"
        ]
    },
    {
        "text": "Next time when I'll be reading some LinkedIn Influencer's story, I am starting from the last line.\nIf there's a link attached to it, it's most probably a fake one.\nSaves me time!",
        "engagement": 188,
        "name": "Codebasics",
        "line_count": 3,
        "language": "English",
        "tags": [
            "Social Media"
        ]
    },
    {
        "text": "Every time I poured my heart into 5-6 rounds of interviews and faced rejection, it felt like a punch in the gut. The sleepless nights, the endless preparation, all for nothing.\n\nBut looking back, I realize it wasn't nothing. It was the Universe's way of saying, “Not this one, something better is on the way.”\n\nEvery single time, I've been shown why that rejection happened.\n\nDoors I thought I wanted to walk through were shut, only to have the right ones swing open.\n\nThe kind that aligned with my growth, my values, and my happiness.\n\nAt first, it stung. It hurt deeply. But now, when things don't go as planned, I don't panic.\n\nI don't question my worth. I sit back, breathe, and trust. The Universe knows.\n\nI know there's another plan waiting. Something bigger, better, and just for me.\n\nTo anyone feeling the weight of rejection: trust that the closed doors are protecting you from something you can't see right now.\n\nYour path is being cleared for something even more beautiful.",
        "engagement": 206,
        "name": "Codebasics",
        "line_count": 17,
        "language": "English",
        "tags": [
            "Mental Health",
            "Motivation"
        ]
    },
    {
        "text": "To everyone who's still looking for a job...\n\nI see you. I feel you. \nEvery rejection email feels like a punch in the gut, and every 'We'll get back to you' sounds more like 'You'll never hear from us.'\n\nBut I want you to know, you're not alone in this. \nAccording to a study, 80% of jobseekers struggle with anxiety and self-doubt during their search. It's normal to feel lost, but it's not the end.\n\nTake breaks, breathe, and remember, this doesn't define you. Your worth is not tied to an offer letter.\nYour mental health matters more than any job.",
        "engagement": 899,
        "name": "Codebasics",
        "line_count": 9,
        "language": "English",
        "tags": [
            "Mental Health",
            "Job Search"
        ]
    },
    {
        "text": "Sometimes, we forget that a company’s brand name doesn’t define someone’s talent. It's easy to get caught up in the 'big company = big talent' mindset, but that's not always the case.\n\nI’ve had the privilege of working with people from smaller companies (lesser known) who blow me away with their skills and dedication. They don’t need a fancy title or a famous brand behind them to prove their worth.\n\nI've seen the other side too—people in top-tier companies feeling lost, overwhelmed, or stuck, even though the world sees them as 'successful'.\n\nLet’s stop attaching someone’s value to the company they work for. Freshers especially need to hear this—skills are what matter, not the size of the company behind them.\n\nAt the end of the day, happiness and growth don’t come from a brand name, they come from doing what you love and constantly improving your craft.",
        "engagement": 166,
        "name": "Codebasics",
        "line_count": 6,
        "language": "English",
        "tags": [
            "Self Improvement",
            "Career Development"
        ]
    },
    {
        "text": "So when I left a toxic work environment, I told my manager a simple thing and felt so good \nI just said-\n\n'Hope your son gets a manager like you.\nI hope that the manager behaves the same way as you did with me.\nThank you.'\n\nNow tell me 1 thing-\n\nShe always said that she was a great manager.\nWhy will she get offended?\n\nI just told her that I wish her son would get a manager like she was.\n\nIf you felt bad, then that means you were a bad manager and now you know it. \nIf you feel good, then take it as a blessing for your son and you'll really want someone to treat your son/daughter in the same way.\n\nShe cannot be even angry with me else it'll prove that she was not a 'great' manager.\n\nMuskan - 1\nManager - 0\n\nMuskan -> Aura +100000000\n\n(Fictional message unfortunately :(\n)\n\nHope you all become the people that your sons/daughters will like to work under 🙏\n\nThere are a lot of bad people/things, bring a small change and break the chain :)",
        "engagement": 1111,
        "name": "Codebasics",
        "line_count": 24,
        "language": "English",
        "tags": [
            "Workplace Issues",
            "Motivation"
        ]
    },
    {
        "text": "Probably one of the longest interviews I've ever done, but I really enjoyed my wide-ranging conversation with Lex Fridman and going deep on so many areas of technology progress. Plus Lex tries out our new XR glasses and Google Beam! ",
        "engagement": 6802,
        "name": "Sundar Pichai",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Technology"
        ]
    },
    {
        "text": "Great to see Alphabet / Google at the top of this list. I've always thought the best 'perk' of the company is my fellow Googlers - brilliant, innovative, and entirely focused on making helpful things for our users and customers. Just a few weeks shy of my 21st (!) Googleversary and still feeling lucky.",
        "engagement": 6185,
        "name": "Sundar Pichai",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Technology"
        ]
    },
    {
        "text": "It’s not every day we have a launch that actually involves a rocket.  After a successful flight over the weekend, the first FireSat satellite is now in orbit! 🛰️ It’s the first of about 50 that we’re launching over the coming few years to help track and detect wildfires, using AI. \n\nFireSat was designed to give us better tools to track and detect fires. Using advanced sensors and high resolution, it can detect a fire as small as 5x5 meters, which wasn't possible before. It updates every 20 minutes, comparing fresh imagery against historical data and factoring in local conditions like infrastructure and weather. Then it beams updates to emergency teams on the ground so they can react in real time. \n\nFireSat builds on our work using AI to map the boundaries of large wildfires and get people accurate information in 27 countries (including during the LA fires earlier this year.) In the next few weeks we’ll start testing, and the system will be fully operational over the next few years.\n\nThis is a huge effort with many partners including Muon Space, Earth Fire Alliance, and the Gordon and Betty Moore Foundation. ",
        "engagement": 32488,
        "name": "Sundar Pichai",
        "line_count": 12,
        "language": "English",
        "tags": [
            "Technology"
        ]
    },
    {
        "text": "Earlier this week, I had a great conversation with Doug McMillon during a visit with Walmart's global technology team. We covered everything from the potential of generative AI and how Walmart is using our Gemini models to improve discoverability on their site... to the partnership with Wing and Walmart to pilot drone deliveries… to my new Walmart+ subscription:) Walmart is an iconic global company, and I enjoyed my visit there. Thanks to the team for having me!",
        "engagement": 4098,
        "name": "Sundar Pichai",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Technology",
            "Companies"
        ]
    },
    {
        "text": "For my first-ever LinkedIn post, I thought I’d share a sneak peek of the Shoreline Amphitheatre stage, as we put some finishing touches on our keynote for Google I/O tomorrow. Can’t wait to see those seats filled with developers from around the world who are building the next generation of AI experiences.\n\nExcited to join Demis Hassabis Elizabeth Reid Sissie H. James Manyika\nand others on stage. We'll share how our Gemini models are bringing breakthrough AI capabilities to people through our products, as well as innovation across safety, research, infrastructure…we’re going to talk about it all. Tune in if you can — 10 a.m. PT tomorrow! https://io.google",
        "engagement": 8063,
        "name": "Sundar Pichai",
        "line_count": 6,
        "language": "English",
        "tags": [
            "Technology"
        ]
    },
    {
        "text": "It was great to sit down with David Friedberg from the All-In team for a wide-ranging conversation. Fun to reminisce and look ahead… from how we see a big opportunity with Search, the investments we’re making in our world-class infrastructure and TPUs, and how we’re leaning into these moments of massive innovation.\n\nThanks again to David for the time. Link in the comments.",
        "engagement": 5850,
        "name": "Sundar Pichai",
        "line_count": 2,
        "language": "English",
        "tags": [
            "Unknown",
            "Job Search"
        ]
    },
    {
        "text": "It’s been a strong start to 2025 — and we’re only just getting started \nAcross Google and Alphabet, Q1 saw great momentum in our products, our platforms, and the impact we’re having around the world.\n\nA few highlights:\n\n Gemini 2.5, our most intelligent model yet, is leading the industry and sets a strong foundation for our future innovation.\n AI Overviews in Search are now used by over 1.5 billion people each month, and we’re excited about the early reaction to AI Mode in Search, lots more to come.\n Subscriptions surpassed 270 million, led by YouTube and Google One.\n Gemini is now available in all 15 Google products that have over half a billion users — and it’s redefining what AI-first smartphones can do, including our latest Pixel 9a.\n At Google Cloud Next, we launched Ironwood, our most powerful TPU to date, and became the first to offer NVIDIA’s next-gen Blackwell GPUs. We’re also rolling out new tools for building and orchestrating multi-agent AI systems.\n YouTube celebrated its 20th birthday — still #1 in U.S. streaming on TVs, and now with 125M+ Music & Premium subscribers and over a billion podcast users.\nWaymo is now serving 250,000+ paid rides a week, and started operation in Silicon Valley. Miami and DC coming next year!\n\nThis work is only possible thanks to the incredible teams across Alphabet — thank you. With I/O, Brandcast, and Google Marketing Live just around the corner — there’s so much more to come in Q2!",
        "engagement": 12977,
        "name": "Sundar Pichai",
        "line_count": 15,
        "language": "English",
        "tags": [
            "Technology"
        ]
    },
    {
        "text": "Yesterday I was in Pittsburgh, which is a really special place for me - one of the first cities I visited in the US and where we announced our Grow with Google economic opportunity initiative in 2017. I spent the day with the next generation of technologists, from high schoolers who are starting to explore STEM, to college students embarking on their computer science and technology careers.",
        "engagement": 7890,
        "name": "Sundar Pichai",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Technology",
            "Education"
        ]
    },
    {
        "text": "THE SUPREME COURT IS BEING PLAYED BY THE RADICAL LEFT LOSERS, WHO HAVE NO SUPPORT, THE PUBLIC HATES THEM, AND THEIR ONLY HOPE IS THE INTIMIDATION OF THE COURT, ITSELF. WE CAN’T LET THAT HAPPEN TO OUR COUNTRY!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "Republicans MUST UNITE behind, “THE ONE, BIG BEAUTIFUL BILL!” Not only does it cut Taxes for ALL Americans, but it will kick millions of Illegal Aliens off of Medicaid to PROTECT it for those who are the ones in real need. The Country will suffer greatly without this Legislation, with their Taxes going up 65%. It will be blamed on the Democrats, but that doesn’t help our Voters. We don’t need “GRANDSTANDERS” in the Republican Party. STOP TALKING, AND GET IT DONE! It is time to fix the MESS that Biden and the Democrats gave us. Thank you for your attention to this matter!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "Today, I signed an Executive Order to launch the first-ever self-deportation program. Illegal aliens who stay in America face punishments, including—sudden deportation, in a place and manner solely of our discretion. TO ALL ILLEGAL ALIENS: BOOK YOUR FREE FLIGHT RIGHT NOW!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "The Democrats are really out of control. They have lost everything, especially their minds! These Radical Left Lunatics are into the “Impeachment thing” again. They have already got two “No Name,” little respected Congressmen, total Whackjobs both, throwing the “Impeachment” of DONALD J. TRUMP around, for about the 20th time, even though they have no idea for what I would be Impeached. Maybe it should be for cleaning up the MESS that they left us on the Border, or the Highest Inflation in our Country’s History or, perhaps, it should be the incompetent Withdrawal from Afghanistan, or Russia, Russia, Russia/Ukraine, Ukraine, Ukraine, or the Attack of Israel on October 7th that only proceeded because they allowed Iran to regain Great Wealth. These Congressmen stated that, they didn’t know why they would Impeach me but, “We just want to do it.” The Republicans should start to think about expelling them from Congress for all of the crimes that they have committed, especially around Election time(s). These are very dishonest people that won’t let our Country heal! Why do we allow them to continuously use Impeachment as a weapon against the President of the United States who, by all accounts, is working hard to SAVE OUR COUNTRY. It’s the same playbook that they used in my First Term, and Republicans are not going to allow them to get away with it again. These are total LOWLIFES, who hate our Country, and everything it stands for. Perhaps we should start playing this game on them, and expel Democrats for the many crimes that they have committed — And these are REAL crimes. Remember, “Shifty” Adam Schiff demanded a Pardon, and they had to use the power of the Auto Pen, and a Full Pardon, for him and the Unselect Committee of Political Thugs, to save them from Expulsion, and probably worse!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "REBUILD, AND OPEN ALCATRAZ! For too long, America has been plagued by vicious, violent, and repeat Criminal Offenders, the dregs of society, who will never contribute anything other than Misery and Suffering. When we were a more serious Nation, in times past, we did not hesitate to lock up the most dangerous criminals, and keep them far away from anyone they could harm. That’s the way it’s supposed to be. No longer will we tolerate these Serial Offenders who spread filth, bloodshed, and mayhem on our streets. That is why, today, I am directing the Bureau of Prisons, together with the Department of Justice, FBI, and Homeland Security, to reopen a substantially enlarged and rebuilt ALCATRAZ, to house America’s most ruthless and violent Offenders. We will no longer be held hostage to criminals, thugs, and Judges that are afraid to do their job and allow us to remove criminals, who came into our Country illegally. The reopening of ALCATRAZ will serve as a symbol of Law, Order, and JUSTICE. We will, MAKE AMERICA GREAT AGAIN!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Social Justice",
            "US Politics"
        ]
    },
    {
        "text": "Sleepy Joe Biden, THE WORST PRESIDENT IN THE HISTORY OF THE UNITED STATES, has allowed millions and millions of Criminals, many of them murderers, drug dealers, and people released from prisons and mental institutions from all around the world, to enter our Country through it’s very dangerous and ill conceived Open Border. Sorry, but it’s my job to get these killers and thugs out of here. THAT’S WHAT I GOT ELECTED TO DO. MAGA!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "Following my Day One Executive Order, the Office of Personnel Management will be issuing new Civil Service Regulations for career government employees. Moving forward, career government employees, working on policy matters, will be classified as “Schedule Policy/Career,” and will be held to the highest standards of conduct and performance. If these government workers refuse to advance the policy interests of the President, or are engaging in corrupt behavior, they should no longer have a job. This is common sense, and will allow the federal government to finally be “run like a business.” We must root out corruption and implement accountability in our Federal Workforce!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "This is the hand of the man that the Democrats feel should be brought back to the United States, because he is such “a fine and innocent person.” They said he is not a member of MS-13, even though he’s got MS-13 tattooed onto his knuckles, and two Highly Respected Courts found that he was a member of MS-13, beat up his wife, etc. I was elected to take bad people out of the United States, among other things. I must be allowed to do my job. MAKE AMERICA GREAT AGAIN!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics",
            "Crime"
        ]
    },
    {
        "text": "The United States has a chance to do something that should have been done DECADES AGO. Don’t be Weak! Don’t be Stupid! Don’t be a PANICAN (A new party based on Weak and Stupid people!). Be Strong, Courageous, and Patient, and GREATNESS will be the result!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Motivation",
            "Leadership"
        ]
    },
    {
        "text": "Oil prices are down, interest rates are down (the slow moving Fed should cut rates!), food prices are down, there is NO INFLATION, and the long time abused USA is bringing in Billions of Dollars a week from the abusing countries on Tariffs that are already in place. This is despite the fact that the biggest abuser of them all, China, whose markets are crashing, just raised its Tariffs by 34%, on top of its long term ridiculously high Tariffs (Plus!), not acknowledging my warning for abusing countries not to retaliate. They’ve made enough, for decades, taking advantage of the Good OL’ USA! Our past “leaders” are to blame for allowing this, and so much else, to happen to our Country. MAKE AMERICA GREAT AGAIN!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Places",
            "Economy"
        ]
    },
    {
        "text": "These Houthis gathered for instructions on an attack. Oops, there will be no attack by these Houthis! They will never sink our ships again!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Geopolitics",
            "Crime"
        ]
    },
    {
        "text": "REPUBLICANS MUST DEFUND AND TOTALLY DISASSOCIATE THEMSELVES FROM NPR & PBS, THE RADICAL LEFT “MONSTERS” THAT SO BADLY HURT OUR COUNTRY!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Media",
            "US Politics"
        ]
    },
    {
        "text": "In two months, there has been more Private Investment spoken for, and/or committed to, than in four years of the Sleepy Joe Biden Administration — A fact that the Fake News hates talking about!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Economy",
            "US Politics"
        ]
    },
    {
        "text": "Thank you President Bukele, of El Salvador, for taking the criminals that were so stupidly allowed, by the Crooked Joe Biden Administration, to enter our Country, and giving them such a wonderful place to live!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Places",
            "US Politics"
        ]
    },
    {
        "text": "America First Patriot Randy Fine is running to represent the Wonderful People of Florida’s 6th Congressional District! A highly successful, Harvard educated businessman, and greatly respected State Legislator, Randy has been a tremendous Voice for MAGA. In Congress, Randy will be an incredible fighter, who will work tirelessly with me to Strengthen our Economy, Lower Taxes, Secure the Border, Champion our Military/Vets, Ensure American Energy DOMINANCE, Protect our always under siege Second Amendment, and Advance PEACE THROUGH STRENGTH.\n\nRandy Fine has my Complete and Total Endorsement! Election Day is this Tuesday, April 1st. GET OUT AND VOTE FOR RANDY — HE WILL NOT LET YOU DOWN! https://swampthevoteusa.com/fl-06/",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "Jimmy Patronis, Chief Financial Officer and Fire Marshall for the Great State of Florida, is running an incredible Campaign for Congress in Florida’s 1st Congressional District! A fourth generation Floridian from the beautiful Panhandle, and owner of an iconic seafood restaurant, Jimmy has been a wonderful friend to me, and to MAGA. As your next Congressman, Jimmy will fight hard alongside of me to Grow our Economy, Cut Taxes, Secure our Border, Stop Migrant Crime, Strengthen our Brave Military/Vets, Restore American Energy DOMINANCE, and Defend our always under siege Second Amendment.\n\nFlorida, Election Day is this Tuesday, April 1st. GET OUT AND VOTE FOR JIMMY PATRONIS. Jimmy has my Complete and Total Endorsement — HE WILL NEVER LET YOU DOWN! https://swampthevoteusa.com/fl-01/",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "SIGNAL SCANDAL:  Katherine Maher, the leftist NPR CEO, is currently the Chair of the Board of Signal!\n\nWHAT ARE THE ODDS?",
        "name": "Donald Trump",
        "line_count": 2,
        "language": "English",
        "tags": [
            "Media",
            "Scams"
        ]
    },
    {
        "text": "We know exactly where the so-called \"Supreme Leader\" is hiding. He is an easy target but safe there. We are not going to take him out (kill!), at least not for now. But we don't want missiles shot at civilians, or American soldiers. Our patience is wearing thin. Thank you for your attention to this matter",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Geopolitics",
            "US Politics"
        ]
    },
    {
        "text": "My NEW Official Trump Meme is HERE! It’s time to celebrate everything we stand for: WINNING! Join my very special Trump Community. GET YOUR $TRUMP NOW. Go to http://gettrumpmemes.com — Have Fun!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics",
            "Social Media"
        ]
    },
    {
        "text": "Our Country is a disaster, a laughing stock all over the World! This is what happens when you have OPEN BORDERS, with weak, ineffective, and virtually nonexistent leadership. The DOJ, FBI, and Democrat state and local prosecutors have not done their job. They are incompetent and corrupt, having spent all of their waking hours unlawfully attacking their political opponent, ME, rather than focusing on protecting Americans from the outside and inside violent SCUM that has infiltrated all aspects of our government, and our Nation itself. Democrats should be ashamed of themselves for allowing this to happen to our Country. The CIA must get involved, NOW, before it is too late. The USA is breaking down - A violent erosion of Safety, National Security, and Democracy is taking place all across our Nation. Only strength and powerful leadership will stop it. See you on January 20th. MAKE AMERICA GREAT AGAIN!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "With the Biden “Open Border’s Policy” I said, many times during Rallies, and elsewhere, that Radical Islamic Terrorism, and other forms of violent crime, will become so bad in America that it will become hard to even imagine or believe. That time has come, only worse than ever imagined. Joe Biden is the WORST PRESIDENT IN THE HISTORY OF AMERICA, A COMPLETE AND TOTAL DISASTER. What he and his group of Election Interfering “thugs” have done to our Country will not soon be forgotten! MAGA",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "Will be going to the Army/Navy Game tomorrow to root on these fantastic young men. Should be a great game. See you there! DJT",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Sports",
            "US Politics"
        ]
    },
    {
        "text": "The Republican Party will use its best efforts to eliminate Daylight Saving Time, which has a small but strong constituency, but shouldn’t! Daylight Saving Time is inconvenient, and very costly to our Nation.",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Time",
            "US Politics"
        ]
    },
    {
        "text": "The resignation of Christopher Wray is a great day for America as it will end the Weaponization of what has become known as the United States Department of Injustice. I just don’t know what happened to him. We will now restore the Rule of Law for all Americans. Under the leadership of Christopher Wray, the FBI illegally raided my home, without cause, worked diligently on illegally impeaching and indicting me, and has done everything else to interfere with the success and future of America. They have used their vast powers to threaten and destroy many innocent Americans, some of which will never be able to recover from what has been done to them. Kash Patel is the most qualified Nominee to lead the FBI in the Agency’s History, and is committed to helping ensure that Law, Order, and Justice will be brought back to our Country again, and soon. As everyone knows, I have great respect for the rank-and-file of the FBI, and they have great respect for me. They want to see these changes every bit as much as I do but, more importantly, the American People are demanding a strong, but fair, System of Justice. We want our FBI back, and that will now happen. I look forward to Kash Patel’s confirmation, so that the process of Making the FBI Great Again can begin. Thank you",
        "name": "Donald Trump",
        "line_count": 9,
        "language": "English",
        "tags": [
            "Social Justice",
            "US Politics"
        ]
    },
    {
        "text": "Opposition fighters in Syria, in an unprecedented move, have totally taken over numerous cities, in a highly coordinated offensive, and are now on the outskirts of Damascus, obviously preparing to make a very big move toward taking out Assad. Russia, because they are so tied up in Ukraine, and with the loss there of over 600,000 soldiers, seems incapable of stopping this literal march through Syria, a country they have protected for years. This is where former President Obama refused to honor his commitment of protecting the RED LINE IN THE SAND, and all hell broke out, with Russia stepping in. But now they are, like possibly Assad himself, being forced out, and it may actually be the best thing that can happen to them. There was never much of a benefit in Syria for Russia, other than to make Obama look really stupid. In any event, Syria is a mess, but is not our friend, & THE UNITED STATES SHOULD HAVE NOTHING TO DO WITH IT. THIS IS NOT OUR FIGHT. LET IT PLAY OUT. DO NOT GET INVOLVED!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Geopolitics"
        ]
    },
    {
        "text": "I am delighted to nominate Jared Isaacman, an accomplished business leader, philanthropist, pilot, and astronaut, as Administrator of the National Aeronautics and Space Administration (NASA). Jared will drive NASA’s mission of discovery and inspiration, paving the way for groundbreaking achievements in Space science, technology, and exploration.\n\nOver the past 25 years, as the Founder and CEO of Shift4, Jared has demonstrated exceptional leadership, building a trailblazing global financial technology company. He also co-founded and served as CEO of Draken International, a defense aerospace company, for over a decade, supporting the U.S. Department of Defense, and our Allies.\n\nJared’s passion for Space, astronaut experience, and dedication to pushing the boundaries of exploration, unlocking the mysteries of the universe, and advancing the new Space economy, make him ideally suited to lead NASA into a bold new Era.\n\nCongratulations to Jared, his wife Monica, and their children, Mila and Liv!",
        "name": "Donald Trump",
        "line_count": 9,
        "language": "English",
        "tags": [
            "Space",
            "Technology"
        ]
    },
    {
        "text": "The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER. We require a commitment from these Countries that they will neither create a new BRICS Currency, nor back any other Currency to replace the mighty U.S. Dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful U.S. Economy. They can go find another “sucker!” There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Geopolitics",
            "Economy"
        ]
    },
    {
        "text": "Happy Thanksgiving to all, including to the Radical Left Lunatics who have worked so hard to destroy our Country, but who have miserably failed, and will always fail, because their ideas and policies are so hopelessly bad that the great people of our Nation just gave a landslide victory to those who want to MAKE AMERICA GREAT AGAIN! Don’t worry, our Country will soon be respected, productive, fair, and strong, and you will be, more than ever before, proud to be an American!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Holidays",
            "US Politics"
        ]
    },
    {
        "text": "These cases, like all of the other cases I have been forced to go through, are empty and lawless, and should never have been brought. Over $100 Million Dollars of Taxpayer Dollars has been wasted in the Democrat Party’s fight against their Political Opponent, ME. Nothing like this has ever happened in our Country before. They have also used State Prosecutors and District Attorneys, such as Fani Willis and her lover, Nathan Wade (who had absolutely zero experience in cases such as this, but was paid MILLIONS, enough for them to take numerous trips and cruises around the globe!), Letitia James, who inappropriately, unethically, and probably illegally, campaigned on “GETTING TRUMP” in order to win Political Office, and Alvin Bragg, who himself never wanted to bring this case against me, but was forced to do so by the Justice Department and the Democrat Party. It was a political hijacking, and a low point in the History of our Country that such a thing could have happened, and yet, I persevered, against all odds, and WON. MAKE AMERICA GREAT AGAIN!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "JUSTICE FOR LAKEN RILEY! The Illegal who killed our beloved Laken Riley was just found GUILTY on all counts for his horrific crimes. Although the pain and heartbreak will last forever, hopefully this can help bring some peace and closure to her wonderful family who fought for Justice, and to ensure that other families don’t have to go through what they have. We love you, Laken, and our hearts will always be with you. It is time to secure our Border, and remove these criminals and thugs from our Country, so nothing like this can happen again!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Social Justice",
            "US Politics"
        ]
    },
    {
        "text": "The Democrats are trying to stack the Courts with Radical Left Judges on their way out the door. Republican Senators need to Show Up and Hold the Line — No more Judges confirmed before Inauguration Day!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "I’m heading to the Great State of Texas to watch the launch of the largest object ever to be elevated, not only to Space, but simply by lifting off the ground. Good luck to @ElonMusk and the Great Patriots involved in this incredible project!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Technology",
            "People"
        ]
    },
    {
        "text": "I am thrilled to announce Robert F. Kennedy Jr. as The United States Secretary of Health and Human Services (HHS). For too long, Americans have been crushed by the industrial food complex and drug companies who have engaged in deception, misinformation, and disinformation when it comes to Public Health. The Safety and Health of all Americans is the most important role of any Administration, and HHS will play a big role in helping ensure that everybody will be protected from harmful chemicals, pollutants, pesticides, pharmaceutical products, and food additives that have contributed to the overwhelming Health Crisis in this Country. Mr. Kennedy will restore these Agencies to the traditions of Gold Standard Scientific Research, and beacons of Transparency, to end the Chronic Disease epidemic, and to Make America Great and Healthy Again!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Public Health"
        ]
    },
    {
        "text": "Roberto Clemente, the Pride of Puerto Rico, was one of the greatest baseball players in history, and also a tremendous humanitarian. He gave his life helping others, dying in a plane crash while delivering relief supplies to earthquake victims on New Year’s Eve 1972. He remains a legend in Puerto Rico and in Pittsburgh. It was my pleasure to talk about his legacy with his oldest son, Roberto Jr., at our rally in Pittsburgh. It’s wonderful to have his support.",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Places",
            "People"
        ]
    },
    {
        "text": "We are just ONE DAY AWAY from what will be the most important political event in the history of our Country—but you have to GET OUT AND VOTE! Together, WE will MAKE AMERICA GREAT AGAIN!!!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "I was thrilled to be back in GEORGIA tonight, with thousands of proud, hardworking American Patriots! We are just two days away from what will be the most important political event in the history of our Country—but you have to GET OUT AND VOTE!",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Places",
            "US Politics"
        ]
    },
    {
        "text": "Mimi Ramirez-Rodriguez was kidnapped and murdered by an illegal alien—leaving behind a 9 year-old girl. I met her grieving mom Carmen tonight in Georgia. With your vote Tuesday, we will end Kamala’s invasion and we will not allow illegals to spill one more drop of American blood.",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Places",
            "People"
        ]
    },
    {
        "text": "With your vote on Tuesday, I WILL END INFLATION, I WILL STOP THE INVASION OF CRIMINALS COMING INTO OUR COUNTRY, and I WILL BRING BACK THE AMERICAN DREAM!\n\nThank you—North Carolina, I love you! #MAGA",
        "name": "Donald Trump",
        "line_count": 2,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    },
    {
        "text": "As we rescue our economy, I will also restore our borders. Over the past 4 years, Kamala has orchestrated the most egregious betrayal that any leader in American history has ever inflicted on our people. She has violated her oath, eradicated our sovereign border, and unleashed an army of gangs and criminal migrants from prisons and jails, insane asylums and mental institutions around the world, from Venezuela to the Congo—stealing countless American lives.",
        "name": "Donald Trump",
        "line_count": 1,
        "language": "English",
        "tags": [
            "Economy",
            "US Politics"
        ]
    },
    {
        "text": "While I am running a campaign of positive solutions to save America, Kamala Harris is running a campaign of hate. She has spent all week comparing her political opponents to the most evil mass murderers in history. Now, on top of everything, Joe Biden calls our supporters “garbage.” You can’t lead America if you don’t love the American People. Kamala Harris and Joe Biden have shown they are both unfit to be President of the United States.\n\nI am proud to lead the biggest, broadest, and most important political coalition in American history. We are welcoming historic numbers of Latinos, African Americans, Asian Americans, and citizens of every race, religion, color, and creed. It is my desire to be the President of all the people.\n\nDerrick Anderson is running to represent the wonderful people of Virginia’s 7th Congressional District. He bravely fought for our Great Country as a Green Beret, and was deployed to Afghanistan, Bahrain, Jordan, Israel, and Lebanon. Unlike the current administration, he never left anyone behind!\n\nDerrick is America First all the way, and he is running against a weak and pathetic Democrat named Yevgeny “Eugene” Vindman who, along with Adam “Shifty” Schiff and others, lied to push the Ukraine Impeachment Hoax, a continuation of the greatest and most dangerous Political WITCH HUNT in the History of our Country!\n\nDerrick Anderson has my Complete and Total Endorsement - HE WILL NOT LET YOU DOWN!",
        "name": "Donald Trump",
        "line_count": 16,
        "language": "English",
        "tags": [
            "US Politics"
        ]
    }
]